Repository: tecogonaz0439/TCSameuraDamMonitor-apple
Catalog: TCSameuraDamMonitor/Localizable.xcstrings
Source language: en
Languages: ja

# accessibility.currentlySelected
source: Currently selected
ja: 現在選択中

# accessibility.card.collapseFormat
source: Collapse %@
ja: %@を折りたたむ

# accessibility.card.collapsed
source: Collapsed
ja: 折りたたみ済み

# accessibility.card.expandFormat
source: Expand %@
ja: %@を展開

# accessibility.card.expanded
source: Expanded
ja: 展開済み

# action.no
source: No
ja: いいえ

# action.yes
source: Yes
ja: はい

# app.name
source: Sameura Dam Monitor
ja: 早明浦ダム 貯水率モニタ

# appInfo.codeberg
source: Repository (Codeberg)
ja: リポジトリ(Codeberg)

# appInfo.github
source: Repository (GitHub)
ja: リポジトリ(GitHub)

# appInfo.license
source: License
ja: ライセンス

# appInfo.ossLicense
source: OSS License
ja: OSSライセンス

# appInfo.privacyPolicy
source: Privacy Policy
ja: プライバシーポリシー

# appInfo.privacyPolicyJa
source: Privacy Policy (Japanese Translation)
ja: プライバシーポリシー(日本語翻訳)

# appInfo.termsOfUse
source: Terms of Use
ja: 利用規約

# appInfo.termsOfUseJa
source: Terms of Use (Japanese original text)
ja: 利用規約

# appInfo.version
source: Version
ja: バージョン

# autoUpdateInterval.oneDay
source: 1 day
ja: 1日

# autoUpdateInterval.oneHour
source: 1 hour
ja: 1時間

# autoUpdateInterval.oneWeek
source: 1 week (Every 7 days)
ja: 1週間 (7日間隔)

# autoUpdateInterval.twelveHours
source: 12 hours
ja: 12時間

# common.back
source: Back
ja: 戻る

# common.cancel
source: Cancel
ja: キャンセル

# common.close
source: Close
ja: 閉じる

# common.copy
source: Copy
ja: コピー

# common.copyGeoUrl
source: Copy geo URI
ja: geo URIをコピー

# common.copyLinkTitle
source: Copy Title
ja: タイトルをコピー

# common.delete
source: Delete
ja: 削除

# common.deleteAll
source: Delete All
ja: すべて削除

# common.done
source: Done
ja: 完了

# common.edit
source: Edit
ja: 編集

# common.export
source: Save
ja: 保存

# common.loading
source: Loading...
ja: 読み込み中...

# common.loadingEllipsis
source: Loading...
ja: 読込中…

# common.moreActions
source: More Actions
ja: その他の操作

# common.noCachedData
source: No cached data
ja: キャッシュデータなし

# common.noData
source: No Data
ja: データがありません

# common.notSet
source: Not set
ja: 未設定

# common.openMap
source: Open Map
ja: 地図を開く

# common.openURL
source: Open URL
ja: URLを開く

# common.retry
source: Retry
ja: 再試行

# common.save
source: Save
ja: 保存

# common.selectGeoAction
source: Select an action for the location
ja: 位置情報に対する操作を選択してください

# common.selectLinkAction
source: Select an action for the link
ja: リンクに対する操作を選択してください

# common.selectRepositoryAction
source: Select an action for the repository
ja: リポジトリに対する操作を選択してください

# common.share
source: Share
ja: 共有

# common.shareGeoUrl
source: Share geo URI
ja: geo URIを共有

# common.shareLinkTitle
source: Share Title
ja: タイトルを共有

# common.open
source: Open
ja: 開く

# common.shareURL
source: Share URL
ja: URLを共有

# damSelection.selectAction
source: Select
ja: 選択

# damSelection.title
source: Select a Dam
ja: ダムを選択

# dialog.initialAutoUpdate.message
source: By default, observation data is automatically fetched once a week (early Monday morning). The auto-update interval and timing can be changed in settings.
ja: デフォルトでは、1週間に1回(月曜の未明〜明け方)自動的に観測データを取得します。自動更新の間隔やタイミングは設定より変更可能です。

# dialog.initialAutoUpdate.title
source: Enable Auto Update?
ja: 自動更新を有効にしますか？

# dialog.license.title
source: License
ja: ライセンス

# dialog.ossLicense.title
source: OSS License
ja: OSSライセンス

# dialog.privacyPolicy.title
source: Privacy Policy
ja: プライバシーポリシー

# dialog.privacyPolicyJa.title
source: Privacy Policy
ja: プライバシーポリシー

# dialog.termsOfUse.title
source: Terms of Use
ja: 利用規約

# dialog.termsOfUseJa.title
source: Terms of Use (Japanese original text)
ja: 利用規約

# dialog.version.format
source: Version %@ (Build %@)
ja: バージョン %@ (ビルド %@)

# dialog.version.title
source: Version
ja: バージョン

# dialogMessageJaLabel
source: Message (Japanese)
ja: メッセージ(日本語)

# dialogMessageNonJaLabel
source: Message (Non-Japanese)
ja: メッセージ(日本語以外)

# error.damConfigMissing
source: Target dam configuration was not found.
ja: 対象ダムの設定が見つかりません。

# error.debugFileMissing
source: Debug dat file was not found.
ja: デバッグ用 dat ファイルが見つかりません。

# error.duplicateHistoricalSearch
source: The same dam and period is already saved.
ja: 同じダム・期間の過去データが既に存在します。

# error.historicalSearchLimitExceeded
source: Saved historical searches are limited to 16 items.
ja: 過去データ検索の保存件数は 16 件までです。

# error.historicalSearchNotSupported
source: This dam does not support historical search.
ja: このダムは過去データ検索に対応していません。

# error.invalidDebugDatFile
source: Select a valid MLIT .dat file.
ja: 有効な国土交通省 .dat ファイルを選択してください。

# error.invalidMLITURL
source: Only HTTPS MLIT URLs are allowed.
ja: HTTPS の国土交通省 URL のみ利用できます。

# error.modelContextNotReady
source: Local database is not ready.
ja: ローカルデータベースの準備ができていません。

# error.networkUnavailable
source: Network is unavailable.
ja: ネットワークに接続できません。

# error.noHistoricalData
source: No historical data was found.
ja: 過去データが見つかりません。

# error.responseTooLarge
source: Response is too large.
ja: レスポンスサイズが大きすぎます。

# error.simulatedLoadingFailure
source: Simulated loading failure.
ja: データ読込失敗を再現しました。

# error.simulatedNetworkUnavailable
source: Simulated network unavailable.
ja: ネットワーク接続不可を再現しました。

# error.title
source: Error
ja: エラー

# error.persistenceFailure.detail
source: Settings are stored separately and are not reset by this recovery attempt.
ja: 設定は別に保存されているため、この復旧処理では初期化されません。

# error.persistenceFailure.message
source: Local dam data storage could not be prepared. Existing SwiftData files were backed up and recreated, but the retry also failed.
ja: ローカルのダムデータ保存領域を準備できませんでした。既存の SwiftData ファイルを退避して再作成しましたが、再試行にも失敗しました。

# error.persistenceFailure.title
source: Local Data Storage Unavailable
ja: ローカルデータ保存を使用できません

# graph.allStorageRate
source: All Storage Rate
ja: 貯水率全て

# graph.allStorageVolume
source: All Storage Volume
ja: 貯水量全て

# graph.comparisonYears
source: Comparison years
ja: 比較対象年

# graph.chipRowFade
source: Fade
ja: フェード

# graph.crosshairEnableLabel
source: Show value on tap/drag
ja: タップ/ドラッグで値を表示する

# graph.historicalDataLoadFailed
source: The historical data could not be loaded.
ja: 過去データを読み込めませんでした。

# graph.labelInflowMax
source: Max Inflow:
ja: 流入量 最大:

# graph.labelInflowMin
source: Min Inflow:
ja: 流入量 最小:

# graph.labelOutflowMax
source: Max Outflow:
ja: 放流量 最大:

# graph.labelOutflowMin
source: Min Outflow:
ja: 放流量 最小:

# graph.labelPeriod
source: Period:
ja: 期間:

# graph.labelRainfallMax
source: Max Catchment Rainfall:
ja: 流域平均雨量 最大:

# graph.labelRainfallTotal
source: Catchment Rainfall:
ja: 流域平均雨量:

# graph.labelStorageRateMax
source: Max Storage Rate:
ja: 貯水率 最大:

# graph.labelStorageRateMin
source: Min Storage Rate:
ja: 貯水率 最小:

# graph.labelStorageVolumeMax
source: Max Storage Volume:
ja: 貯水量 最大:

# graph.labelStorageVolumeMin
source: Min Storage Volume:
ja: 貯水量 最小:

# graph.lineInflow
source: Inflow
ja: 流入量

# graph.lineOutflow
source: Outflow
ja: 放流量

# graph.lineRainfall
source: Catchment Rainfall
ja: 流域平均雨量

# graph.lineStorageRate
source: Storage Rate
ja: 貯水率

# graph.lineStorageVolume
source: Storage Volume
ja: 貯水量

# graph.loadingHistoricalData
source: Loading historical data…
ja: 過去データを読み込んでいます…

# graph.observationData
source: Observation Data (Graph)
ja: 観測データ(グラフ)

# graph.rainfallStorageHistorySelect
source: Storage Rate (Year Comparison) / Catchment Rainfall
ja: 貯水率(年比較)／流域平均雨量

# graph.rainfallStorageSelect
source: Storage Rate / Catchment Rainfall
ja: 貯水率／流域平均雨量

# graph.range.all
source: Full Range
ja: 全区間

# graph.range.past24Hours
source: Past 24 Hours
ja: 過去24時間

# graph.range.past48Hours
source: Past 48 Hours
ja: 過去48時間

# graph.range.past72Hours
source: Past 72 Hours
ja: 過去72時間

# graph.retry
source: Retry
ja: 再試行

# graph.storagePercentage
source: Graph (Catchment Rainfall / Storage Rate)
ja: グラフ(流域平均雨量・貯水率)

# graph.tooltipInflow
source: Inflow:
ja: 流入量:

# graph.tooltipOutflow
source: Outflow:
ja: 放流量:

# graph.tooltipRainfall
source: Rainfall:
ja: 流域平均雨量:

# graph.tooltipStorageRate
source: Storage Rate:
ja: 貯水率:

# graph.tooltipStorageVolume
source: Storage Volume:
ja: 貯水量:

# graph.volumeFlow
source: Graph (Storage Volume / Inflow / Outflow)
ja: グラフ(貯水量・流入量・放流量)

# graph.volumeFlowHistorySelect
source: Storage Volume (Year Comparison) / Inflow / Outflow
ja: 貯水量(年比較)／流入量／放流量

# graph.volumeFlowSelect
source: Storage Volume / Inflow / Outflow
ja: 貯水量／流入量／放流量

# historical.manage.deleteAllMessage
source: Are you sure you want to delete all historical data? This action cannot be undone.
ja: すべての過去データを削除しますか？この操作は元に戻せません。

# historical.manage.deleteAllTitle
source: Delete All Historical Data
ja: 過去データをすべて削除

# historical.manage.deleteMessage
source: Are you sure you want to delete this historical data? This action cannot be undone.
ja: この過去データを削除しますか？この操作は元に戻せません。

# historical.manage.deleteTitle
source: Delete Historical Data
ja: 過去データの削除

# historical.manage.empty
source: No historical data available.
ja: 過去データはありません。

# historical.manage.pin
source: Pin
ja: ピン留めする

# historical.manage.pinLimit
source: Up to 5 historical data items can be pinned.
ja: ピン留め可能な過去データは最大5件までです。

# historical.manage.title
source: Historical Data Management
ja: 過去データを管理

# historical.manage.unpin
source: Unpin
ja: ピン留めを解除する

# historical.range.displayButton
source: Display
ja: 表示

# historical.range.errorOutOfBounds
source: Select dates within the original search period.
ja: 検索時の期間内で指定してください。

# historical.range.iconButtonDesc
source: Historical data display range
ja: 過去データ表示期間

# historical.range.reset
source: Reset
ja: リセット

# historical.range.resetIconDesc
source: Clear historical data display range
ja: 過去データ表示期間を解除

# historical.range.title
source: Historical Data Display Range
ja: 過去データ期間指定

# historical.search.button
source: Search
ja: 検索

# historical.search.dam
source: Dam
ja: ダム

# historical.search.dateNotSelected
source: Select date
ja: 日付を選択

# historical.search.duplicate
source: The same dam and period is already saved.
ja: 同じダム・期間の過去データが既に存在します。

# historical.search.endDate
source: End Date
ja: 終了日付

# historical.search.errorDateRange
source: Start date must be before or equal to end date.
ja: 開始日付は終了日付以前の日付を指定してください。

# historical.search.errorToday
source: End date cannot be today or in the future.
ja: 今日以降の日付は指定できません。

# historical.search.errorTooLong
source: Search period must be within 31 days.
ja: 検索期間は31日以内にしてください。

# historical.search.errorTooOld
source: Date must be June 1, 2002, or later.
ja: 検索期間は2002年6月以降にしてください。

# historical.search.maxCountSnackbar
source: Up to %d historical data items can be saved.
ja: 保存可能な過去データは最大%d件までです。

# historical.search.periodNote.format
source: Data period: %@ 01:00 - %@ 00:00.
ja: データの期間は、%@ 01:00 〜 %@ 00:00 となります。

# historical.search.searching
source: Searching...
ja: 検索中…

# historical.search.startDate
source: Start Date
ja: 開始日付

# historical.search.title
source: Historical Data Search
ja: 過去データを検索

# historical.sudmonitorHistory.duplicateLoaded
source: This period is already loaded as sudmonitor daily historical data. Open it from the sidebar
ja: 指定期間は sudmonitor の日次過去データとして読み込み済みです。サイドバーの過去データから表示してください

# main.autorenewDisabled
source: Auto-update is disabled.
ja: 自動更新が無効です。

# main.autorenewEnabledFirst.format
source: Auto-update is enabled. (Interval: %@ | Next update request: %@)
ja: 自動更新が有効です。 (間隔: %@ 次回更新リクエスト: %@)

# main.autorenewEnabledWithLast.format
source: Auto-update is enabled. (Interval: %@ | Last: %@)
ja: 自動更新が有効です。 (間隔: %@ 前回(実績): %@)

# main.autorenewInProgress
source: Auto-update is in progress.
ja: 自動更新が進行中です。

# main.dataFetchTime
source: Read Time
ja: 読込時刻

# main.dataUpdateTime
source: Data Time
ja: データ時刻

# main.dayChange
source: Storage Rate Daily Change (%)
ja: 貯水率(前日比)(%)

# summary.dayChange
source: Prev day
ja: 前日比

# main.fullHistory
source: Observation Data List
ja: 観測データ一覧

# main.geo
source: Location (geo URI)
ja: 位置情報 (geo URI)

# main.historyColDatetime
source: Date/Time
ja: 日時

# main.historyColInflow
source: Inflow (m³/s)
ja: 流入量 (m³/s)

# main.historyColOutflow
source: Outflow (m³/s)
ja: 放流量 (m³/s)

# main.historyColRainfall
source: Rainfall (mm/10min)
ja: 雨量 (mm/10min)

# main.historyColRainfallPerHour
source: Rainfall (mm/h)
ja: 雨量 (mm/h)

# main.historyColStorage
source: Storage (%)
ja: 貯水率 (%)

# main.historyColVolume
source: Volume (×10³m³)
ja: 貯水量 (×10³m³)

# main.historyData
source: Observation Data History
ja: 観測データ(一覧)

# main.historyLoadDate.format
source: Show %@ Data
ja: %@ の観測データを表示

# main.inflow
source: Inflow (m³/s)
ja: 流入量 (m³/s)

# main.initialLoadInProgress
source: Initial load is in progress.
ja: 初回の読込が進行中です。

# main.latestData
source: Latest Observation Data
ja: 観測データ(最新)

# main.manualUpdateInProgress
source: Manual update is in progress.
ja: 手動更新が進行中です。

# main.observationData
source: Observation Station Info
ja: 観測所データ

# main.outflow
source: Outflow (m³/s)
ja: 放流量 (m³/s)

# main.percentageTime
source: Data Time (Storage)
ja: データ時刻(貯水率)

# main.rainfall
source: Catchment Rainfall (mm/10min)
ja: 流域平均雨量 (mm/10min)

# main.rainfallPerHour
source: Catchment Rainfall (mm/h)
ja: 流域平均雨量 (mm/h)

# main.refreshTooEarly.format
source: Manual update will be available after %@.
ja: %@以降に手動更新が可能になります

# main.riverName
source: River
ja: 河川名

# main.riverSystem
source: River System
ja: 水系名

# main.showFullHistory
source: Show all-period observation data
ja: 全期間の観測データを表示

# main.stationID
source: Station ID
ja: 観測所記号

# main.stationName
source: Station
ja: 観測所名

# main.storagePercentage
source: Storage Rate (%)
ja: 貯水率 (%)

# main.storageVolume
source: Storage Volume (×10³m³)
ja: 貯水量 (×10³m³)

# main.titleHistoricalData.format
source: Historical Data Display
ja: 過去データ表示

# main.titleRealtimeData.format
source: Realtime Data Display
ja: リアルタイムデータ表示

# main.urlCardTitle
source: Links
ja: リンク集

# main.weekChange
source: Storage Rate Weekly Change (%)
ja: 貯水率(前週比)(%)

# nav.appInfo
source: About
ja: このアプリについて

# nav.autoUpdate
source: Auto Update
ja: 自動更新

# nav.debug
source: Debug
ja: デバッグ

# nav.historicalData
source: Historical Data
ja: 過去データ

# nav.historicalManage
source: Manage Historical Data
ja: 過去データを管理

# nav.historicalSearch
source: Search Historical Data
ja: 過去データを検索

# nav.manualUpdate
source: Manual Update
ja: 手動更新

# menuBar.openMainWindow
source: Open Sameura Dam Monitor
ja: 早明浦ダム 貯水率モニタを開く

# menuBar.quit
source: Quit Sameura Dam Monitor
ja: 早明浦ダム 貯水率モニタを終了

# menuBarResidency.notResident
source: Do Not Stay
ja: 常駐しない

# menuBarResidency.residentHidden
source: Stay (Window Hidden)
ja: 常駐する(ウインドウ非表示)

# menuBarResidency.residentVisible
source: Stay (Window Shown)
ja: 常駐する(ウインドウ表示)

# menu.aboutApp
source: About Sameura Dam Monitor
ja: 早明浦ダム 貯水率モニタについて

# menu.settings
source: Settings...
ja: 設定…

# nav.realtimeData
source: Realtime Data
ja: リアルタイムデータ

# nav.savedSearches
source: Saved Searches
ja: 保存済み過去データ

# nav.settings
source: Settings
ja: 設定(Settings)

# nav.source
source: Source
ja: 出典

# nav.sourceCredit.format
source: Derived from MLIT Water Information System (retrieved %@)
ja: 国土交通省 水文水質データベース(%@参照)を加工して作成

# nav.sourceDB
source: MLIT Water Information System
ja: 国土交通省 水文水質データベース

# nav.sudmonitorHistory
source: Past Data (Daily)
ja: 過去データ(日次)

# nav.tools
source: Tools
ja: ツール

# resetOptionNonJa
source: Set Messages for General Users
ja: 一般向けメッセージを設定

# resetOtherMessage
source: Reset Message
ja: メッセージをリセット

# settings.allAbnormalMessage
source: Storage Percentage Data Distribution Suspended
ja: 貯水率データ配信停止中

# settings.allDataInvalidMessage
source: Observation Data Distribution Suspended
ja: 全観測データ配信停止中

# settings.appearance
source: Appearance
ja: 外観モード

# settings.appearanceAuto
source: Auto
ja: 自動

# settings.appearanceDark
source: Dark
ja: ダーク

# settings.appearanceLight
source: Light
ja: ライト

# settings.autoUpdate
source: Auto Update
ja: 自動更新

# settings.autoUpdateFooter
source: Automatically fetches observation data. Enabled when the app is open and when a widget is added to the Home Screen or Lock Screen.
ja: 自動的に観測データを取得します。本アプリを開いている時と、ホーム画面とロック画面にウィジェットを追加した時に有効となります。

# settings.autoUpdateFooterMacos
source: Automatically fetches observation data. Enabled when the app is open and when a widget is added to the Home Screen.
ja: 自動的に観測データを取得します。本アプリを開いている時と、ホーム画面にウィジェットを追加した時に有効となります。

# settings.autoUpdateInterval
source: Auto Update Interval
ja: 自動更新 間隔

# settings.autoUpdateIntervalDailyHistoryFooter
source: The daily historical data auto-update interval is 1 day.
ja: 過去データ(日次)の自動更新間隔は1日になります。

# settings.autoUpdateLast
source: Auto Update: Last (Actual)
ja: 自動更新 前回(実績)

# settings.autoUpdateNext
source: Next Update Request
ja: 次回更新リクエスト

# settings.autoUpdateNextDialogDate
source: Date
ja: 日付

# settings.autoUpdateNextDialogTime
source: Time
ja: 時刻

# settings.autoUpdateNextFooterIos
source: Widget updates may be delayed.
ja: ウィジェットでは更新が遅れることがあります。

# settings.autoUpdateNextHint
source: Set the next update request time.
ja: 次回更新リクエストの時刻を設定します

# settings.autoUpdateNextTimingWarning
source: Please choose a time at least 15 minutes from now.
ja: %@(現在時刻の15分後)より後の時刻を指定してください

# settings.damName
source: Dam
ja: ダム

# settings.dataDistributionResumedMessage
source: Observation Data Distribution Resumed
ja: 観測データ配信復帰

# settings.dataDistributionStoppedMessage
source: Observation Data Distribution Stopped
ja: 観測データ配信停止

# settings.dataSourceDamLocked
source: When using sudmonitor.kusugami-lab.net, the dam is fixed to Sameura Dam.
ja: sudmonitor.kusugami-lab.net 利用時は早明浦ダムに固定されます。

# settings.dataSourceHistorical
source: Historical data
ja: 過去データ

# settings.dataSourceHistoricalHelpMlit
source: Historical data is searched from the MLIT Water Information System.
ja: 水文水質データベース(MLIT)から過去データを検索します。

# settings.dataSourceHistoricalHelpSudmonitor
source: Historical data is first searched in the app bundle, or retrieved from cache server %@. If no historical data exists in these data sources, or if the data source is unavailable due to a Cloudflare outage or other reasons, historical data is searched from the MLIT Water Information System.
ja: アプリバンドル、またはキャッシュサーバ%@から過去データの検索を試みます。データソースに過去データが存在しない場合、またはCloudflare障害などの理由でデータソースが利用できない場合は、水文水質データベース(MLIT)から過去データを検索します。

# settings.dataSourceHistoricalValue
source: MLIT Water Information System
ja: 水文水質データベース(MLIT)

# settings.dataSourceRealtime
source: Real-time data
ja: リアルタイムデータ

# settings.dataSourceRealtimeHelpMlit
source: Real-time data is retrieved directly from the MLIT Water Information System.
ja: 水文水質データベース(MLIT)から直接リアルタイムデータを取得します。

# settings.dataSourceRealtimeHelpSudmonitor
source: Real-time data is retrieved from cache server %@.
ja: キャッシュサーバ%@からリアルタイムデータを取得します。

# settings.dataSourceRealtimeMlit
source: MLIT Water Information System
ja: 水文水質データベース(MLIT)

# settings.dataSourceSwitchConfirmAction
source: Switch
ja: 切り替え

# settings.dataSourceSwitchConfirmMessage
source: Switching to sudmonitor.kusugami-lab.net changes the monitored dam to Sameura Dam.
ja: sudmonitor.kusugami-lab.net に切り替えると、監視対象ダムが早明浦ダムに変更されます。

# settings.dataSourceSwitchConfirmTitle
source: Switch data source?
ja: データソースを切り替えますか？

# settings.debugRealtimeDataPeriod
source: Debug Mode Data Period (realtime data)
ja: デバッグモード データ期間(リアルタイムデータ)

# settings.debugDataPeriodAll
source: All
ja: 全て

# settings.debugRealtimeDataPeriodAutoAdvance
source: Advance the data period (realtime data) after each refresh
ja: 観測データ取得ごとにデータ期間(リアルタイムデータ)を更新

# settings.debugDataPeriodCustom
source: Specify period
ja: 期間を指定

# settings.debugDataPeriodEndDate
source: End Date
ja: 終了日付

# settings.debugDataPeriodEndTime
source: End Time
ja: 終了時刻

# settings.debugDataPeriodNote.format
source: Data period: %@ - %@
ja: データの期間は、%@ 〜 %@ となります。

# settings.debugDataPeriodSetButton
source: Set
ja: 設定

# settings.debugDataPeriodStartTime
source: Start Time
ja: 開始時刻

# settings.debugRealtimeDatFile
source: Debug .dat file (realtime data)
ja: デバッグ用 .dat ファイル(リアルタイムデータ)

# settings.debugDatFileBundled
source: Use bundled data file
ja: 組込データファイルを使用

# settings.debugDatFileLatestRealtime
source: Use latest realtime data
ja: 最新リアルタイムデータを使用

# settings.debugDatFileUserSelectedRealtime
source: Use selected realtime data
ja: 選択したリアルタイムデータを使用

# settings.debugDatNone
source: None (uses bundled debug .dat)
ja: 未選択 (同梱のデバッグ用 .dat を使用)

# settings.debugHistoricalDailyDatFile
source: Debug .dat file (daily historical data)
ja: デバッグ用 .dat ファイル(過去データ(日次))

# settings.debugDatFileLatestHistoricalDaily
source: Use latest daily historical data
ja: 最新過去データ(日次)を使用

# settings.debugDatFileUserSelectedHistorical
source: Use selected historical data
ja: 選択した過去データを使用

# settings.debugLogDeleteMessage
source: Are you sure you want to delete all debug log entries?
ja: すべてのデバッグログを削除しますか？

# settings.debugLogDeleteTitle
source: Delete Debug Log
ja: デバッグログの削除

# settings.debugLogEmpty
source: No log entries.
ja: ログがありません。

# settings.debugLogTitle
source: Debug Log
ja: デバッグログ

# settings.debugMode
source: Debug Mode
ja: デバッグモード

# settings.debugSettingsDisabled
source: Debug mode has been disabled.
ja: デバッグモードの設定が無効になりました

# settings.debugSettingsEnabled
source: Debug has been enabled.
ja: デバッグが有効になりました

# settings.debugSimulateMode
source: Reproduce Network/Load Failure
ja: ネットワーク接続不可・データ読込失敗を再現

# settings.dialogCancel
source: Cancel
ja: キャンセル

# settings.dialogErrorOneCharOnly
source: Only 1 character is allowed.
ja: 1文字のみ入力可能です。

# settings.dialogMessageLabel
source: Message
ja: メッセージ

# settings.dialogReset
source: Reset
ja: リセット

# settings.dialogSave
source: Save
ja: 保存

# settings.dialogSetTitle.format
source: Set %@
ja: %@ の設定

# settings.dialogStateLabel
source: State (1 char)
ja: 状態(1文字)

# settings.disableDebug
source: Disable Debug
ja: デバッグを無効にする

# settings.exportRealtimeDat
source: Export .dat file (realtime data)
ja: .dat ファイル(リアルタイムデータ)をエクスポート

# settings.exportHistoricalDailyDat
source: Export .dat file (daily historical data)
ja: .dat ファイル(過去データ(日次))をエクスポート

# settings.exportDebugDatEncodingPrompt
source: Please select an encoding
ja: エンコーディングを選択してください

# settings.exportDebugDatNoData
source: No data available to export.
ja: エクスポートするデータがありません。

# settings.exportDebugDatRaw
source: Original Encoding
ja: オリジナルのエンコーディング

# settings.exportDebugDatUTF8
source: UTF-8 Encoding (with BOM)
ja: UTF-8エンコーディング(BOM付き)

# settings.headerDam
source: Dam Information
ja: ダム情報

# settings.headerDataSource
source: Data Source
ja: データソース

# settings.headerDebug
source: Debug
ja: デバッグ

# settings.headerGeneral
source: General
ja: 一般

# settings.headerSystem
source: System
ja: システム

# settings.initialMessage
source: Initial Message
ja: 初期メッセージ

# settings.language
source: Language
ja: 言語(Language)

# settings.launchAtLogin
source: Launch at Login
ja: ログイン時に起動する

# settings.launchAtLoginFooter
source: Launches this app at login.
ja: ログイン時に本アプリを起動します。

# settings.menuBarResidency
source: Stay in Menu Bar
ja: メニューバーに常駐する

# settings.menuBarResidencyFooterNotResident
source: At app launch, the app opens a window without staying in the menu bar.
ja: 本アプリ起動時にメニューバーに常駐せず、ウインドウを開きます。

# settings.menuBarResidencyFooterResidentHidden
source: At app launch, the app only stays in the menu bar and does not open a window. Open the window from the menu bar icon menu.
ja: 本アプリ起動時にメニューバーに常駐のみ行い、ウインドウは開きません。メニューバーのアイコンメニューよりウインドウを開きます。

# settings.menuBarResidencyFooterResidentVisible
source: At app launch, the app stays in the menu bar and also opens a window.
ja: 本アプリ起動時にメニューバーに常駐した上で、ウインドウも開きます。

# settings.loadingErrorMessage
source: Observation Data Fetch Failure
ja: 観測データ取得失敗

# settings.messageLabel
source: Message
ja: メッセージ

# settings.messagesOther
source: Storage Percentage Messages (Other Dams)
ja: 貯水率メッセージ(早明浦ダム以外)

# settings.messagesSameura
source: Storage Percentage Messages
ja: 貯水率メッセージ

# settings.networkUnavailableMessage
source: Network Unavailable
ja: ネットワーク接続不可

# settings.nextTimingWarning
source: Selected time is in the past
ja: 選択した日時は現在時刻以前です
